
const CYR_LAT_20210128: { [key: string]: string } = {
    'А': 'A',
    'Ә': 'Ä',
    'Б': 'B',
    'В': 'V',
    'Г': 'G',
    'Ғ': 'Ğ',
    'Д': 'D',
    'Е': 'E',
    'Ё': 'Ö',
    'Ж': 'J',
    'З': 'Z',
    'И': 'İ',
    'Й': 'İ',
    'К': 'K',
    'Қ': 'Q',
    'Л': 'L',
    'М': 'M',
    'Н': 'N',
    'Ң': 'Ñ',
    'О': 'O',
    'Ө': 'Ö',
    'П': 'P',
    'Р': 'R',
    'С': 'S',
    'Т': 'T',
    'У': 'U',
    'Ұ': 'Ū',
    'Ү': 'Ü',
    'Ф': 'F',
    'Х': 'H',
    'Һ': 'H',
    'Ц': 'S',
    'Ч': 'Ch',
    'Ш': 'Ş',
    'Щ': 'Ş',
    'Ы': 'Y',
    'І': 'I',
    'Э': 'E',
    'Ю': 'İu',
    'Я': 'İa',
    'Ъ': '',
    'Ь': '',

    'а': 'a',
    'ә': 'ä',
    'б': 'b',
    'в': 'v',
    'г': 'g',
    'ғ': 'ğ',
    'д': 'd',
    'е': 'e',
    'ё': 'ö',
    'ж': 'j',
    'з': 'z',
    'и': 'i',
    'й': 'i',
    'к': 'k',
    'қ': 'q',
    'л': 'l',
    'м': 'm',
    'н': 'n',
    'ң': 'ñ',
    'о': 'o',
    'ө': 'ö',
    'п': 'p',
    'р': 'r',
    'с': 's',
    'т': 't',
    'у': 'u',
    'ұ': 'ū',
    'ү': 'ü',
    'ф': 'f',
    'х': 'h',
    'һ': 'h',
    'ц': 's',
    'ч': 'ch',
    'ш': 'ş',
    'щ': 'ş',
    'ы': 'y',
    'і': 'ı',
    'э': 'e',
    'ю': 'iu',
    'я': 'ia',
    'ъ': '',
    'ь': '',
};

const LAT_20210128_CYR: { [key: string]: string } = {
    'A': 'А',
    'Ä': 'Ә',
    'B': 'Б',
    'V': 'В',
    'G': 'Г',
    'Ğ': 'Ғ',
    'D': 'Д',
    'E': 'Е',
    // 'Ö': 'Ё',
    'J': 'Ж',
    'Z': 'З',
    'İ': 'И',
    // 'İ': 'Й',
    'K': 'К',
    'Q': 'Қ',
    'L': 'Л',
    'M': 'М',
    'N': 'Н',
    'Ñ': 'Ң',
    'O': 'О',
    'Ö': 'Ө',
    'P': 'П',
    'R': 'Р',
    'S': 'С',
    'T': 'Т',
    'U': 'У',
    'Ū': 'Ұ',
    'Ü': 'Ү',
    'F': 'Ф',
    'H': 'Х',
    // 'H': 'Һ',
    // 'S': 'Ц',
    'Ch': 'Ч',
    'Ş': 'Ш',
    // 'Ş': 'Щ',
    'Y': 'Ы',
    'I': 'І',
    // 'E': 'Э',
    'İu': 'Ю',
    'İa': 'Я',

    'a': 'а',
    'ä': 'ә',
    'b': 'б',
    'v': 'в',
    'g': 'г',
    'ğ': 'ғ',
    'd': 'д',
    'e': 'е',
    //'ö': 'ё',
    'j': 'ж',
    'z': 'з',
    'i': 'и',
    // 'i': 'й',
    'k': 'к',
    'q': 'қ',
    'l': 'л',
    'm': 'м',
    'n': 'н',
    'ñ': 'ң',
    'o': 'о',
    'ö': 'ө',
    'p': 'п',
    'r': 'р',
    's': 'с',
    't': 'т',
    'u': 'у',
    'ū': 'ұ',
    'ü': 'ү',
    'f': 'ф',
    'h': 'х',
    // 'h': 'һ',
    // 's': 'ц',
    'ch': 'ч',
    'ş': 'ш',
    // 'ş': 'щ',
    'y': 'ы',
    'ı': 'і',
    // 'e': 'э',
    'iu': 'ю',
    'ia': 'я',
};

function convertCyrillicToLatin20210128(s: string): string {
    let result = "";
    for (const ch of s) {
        if (ch in CYR_LAT_20210128) {
            result += CYR_LAT_20210128[ch];
        } else {
            result += ch;
        }
    }
    return result;
}

function convertLatin20210128ToCyrillic(s: string): string {
    let result = "";
    let n = s.length;
    for (let i = 0; i < n; ) {
        if (i + 1 < n) {
            const two = s.substring(i, i + 2);
            if (two in LAT_20210128_CYR) {
                result += LAT_20210128_CYR[two];
                i += 2
                continue;
            }
        }
        const one = s[i];
        if (one in LAT_20210128_CYR) {
            result += LAT_20210128_CYR[one];
        } else {
            result += one;
        }
        ++i;
    }
    return result;
}