
const CYR_LAT_20210128: { [key: string]: string } = {
    'А': 'A', 'Ә': 'Ä', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Ғ': 'Ğ', 'Д': 'D', 'Е': 'E', 'Ё': 'Ö',
    'Ж': 'J', 'З': 'Z', 'И': 'İ', 'Й': 'İ', 'К': 'K', 'Қ': 'Q', 'Л': 'L', 'М': 'M', 'Н': 'N',
    'Ң': 'Ñ', 'О': 'O', 'Ө': 'Ö', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T', 'У': 'U', 'Ұ': 'Ū',
    'Ү': 'Ü', 'Ф': 'F', 'Х': 'H', 'Һ': 'H', 'Ц': 'S', 'Ч': 'Ch', 'Ш': 'Ş', 'Щ': 'Ş',
    'Ы': 'Y', 'І': 'I', 'Э': 'E', 'Ю': 'İu', 'Я': 'İa',

    'а': 'a', 'ә': 'ä', 'б': 'b', 'в': 'v',
    'г': 'g', 'ғ': 'ğ', 'д': 'd', 'е': 'e', 'ё': 'ö', 'ж': 'j', 'з': 'z', 'и': 'i', 'й': 'i',
    'к': 'k', 'қ': 'q', 'л': 'l', 'м': 'm', 'н': 'n', 'ң': 'ñ', 'о': 'o', 'ө': 'ö', 'п': 'p',
    'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ұ': 'ū', 'ү': 'ü', 'ф': 'f', 'х': 'h', 'һ': 'h',
    'ц': 's', 'ч': 'ch', 'ш': 'ş', 'щ': 'ş', 'ы': 'y', 'і': 'ı', 'э': 'e', 'ю': 'iu', 'я': 'ia',

    'Ъ': '', 'ъ': '', 'Ь': '', 'ь': '',
};

function convertCyrillicToLatin20210128(s: string): string {
    let result = "";
    for (const ch of s) {
        if (ch in CYR_LAT_20210128) {
            result += CYR_LAT_20210128[ch];
        } else {
            result += ch;
        }
    }
    return result;
}