const BASE_REPLACEMENT_PKKH = new Map([
    ["п", "б"],
    ["к", "г"],
    ["қ", "ғ"],
]);

const DROP_VOWEL_POSSESSIVE = new Set([
    "әріп",
    "бөрік",
    "ғұрып",
    "дәріп",
    "ерік",
    "ерін",
    "зауық",
    "кейіп",
    "қаріп",
    "қауіп",
    "құлық",
    "құлып",
    "мойын",
    "мүлік",
    "мұрын",
    "орын",
    "парық",
    "сиық",
    "сұрық",
    "халық",
    "шырық",
    "ырық",
]);

const DROP_VOWEL_POSSESSIVE_ALT = new Set([
    "ауыз",
    "дауыс",
    "көрік",
    "қалып",
    "қарын",
    "қойын",
    "нарық",
    "тұрық",
]);